// // --створити масив з:
// //     - з 5 числових значень
//
// let i = [5,6,7,8,9,10];
// console.log(i);
// // - з 5 стічкових значень
//
// let a = ['a', 's','f' ];
// console.log(a);
// // - з 5 значень стрічкового, числового та булевого типу
// let y = ['hello', 23, true];
// console.log(y);
// // - та вивести його в консоль
// //
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// //
//
// let f = [];
// f[0]= 'd';
// f[1]= 23;
// f[2]= true;
// console.log(f);

//
// // - є масив [2,17,13,6,22,31,45,66,100,-18] :
// // 1. перебрати його циклом while
// let i = [2,17,13,6,22,31,45,66,100,-18];
// let a = 0;
// while (a < i.length) {
//     document.write(`<div>${i[a]}</div>`);
//     a++;
// }



// //     2. перебрати його циклом for
// let i = [2,17,13,6,22,31,45,66,100,-18];
// for (let j = 0; j < i.length; j++) {
//     const iElement = i[j];
//     document.write(`<div>${i}</div>`);{
//         break;
//     }
//
// }




//     3. перебрати циклом while та вивести  числа тільки з непарним індексом


// let iner = [2,17,13,6,22,31,45,66,100,-18];
// let a = 0;
// while (a < iner.length) {
//     if (iner[a] % 2 !== 0) {
//         document.write(`<div>${iner[a]}</div>`)
//     }
//     a++;
// }



// // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let iner = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < iner.length; i++) {
//     if (iner[i] % 2 !== 0) {
//         document.write(`<div>${iner[i]}</div>`);
//     }
//
// }


// 7. замінити кожне число кратне 3 на слово "okten"
// let iner = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < iner.length; i++) {
//     // if (iner[i] % 3 ===0) {
//     //     document.write(`<div>octen</div>`);
//     // } else {
//     //     document.write(`<div>${iner[i]}</div>`);
//     // }
//     //
// }

// 8. вивести масив в зворотньому порядку.

// let iner = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = iner.length - 1; i >= 0; i--) {
//     document.write(`<div>${iner[i]}</div>`);
//
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// let iner = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = iner.length - 1; i >= 0; i--)  {
//     if (iner[i] % 3 ===0) {
//         document.write(`<div>octen</div>`);
//     } else {
//         document.write(`<div>${iner[i]}</div>`);
//     }
// }

// let iner = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = iner.length - 1; i >= 0; i--) {
//     if (iner[i] % 2 !== 0) {
//         document.write(`<div>${iner[i]}</div>`);
//     }
//
// }



// let i = [2,17,13,6,22,31,45,66,100,-18];
// let a = 0;
// while (a === arr.length) {
//     document.write(`<div>${i[a]}</div>`);
//     a--;
// }



